# Pandas: Count occurrences of a specific value in a column

In [1]:
import pandas as pd
import numpy as np

In [2]:
test_data = pd.read_csv('groupby.csv')

In [3]:
test_data.head()

   D  R  X1        OpenTimestamp          Pnl  Win
0  7  2   1  2022-01-17 09:24:16 -1009.782609    0
1  7  2   1  2022-01-17 12:37:27 -1009.782609    0
2  7  2   1  2022-01-17 15:08:06  -493.478261    0
3  7  2   1  2022-01-18 10:41:10   919.565217    1
4  7  2   1  2022-01-18 14:35:19 -1009.782609    0

In [4]:
# calculate sum of 'Win' column for rows where D is equal to 9

test_data.loc[test_data['D'] == 9, 'Win'].sum()

1619

# Pandas: GroupBy and Value Counts

In [5]:
#count frequency of Win, grouped by D and X1
test_data.groupby(['D', 'X1', 'Win']).size().unstack(fill_value=0)

Win     0    1
D X1
7 1   372  385
  2   330  387
  3   890  796
  4   312  336
  5   113   63
  6   129   99
8 1   344  374
  2   282  252
  3   766  739
  4   215  320
  5    79  103
  6    96   93
9 1   353  396
  2   269  248
  3   597  619
  4   164  222
  5    90   43
  6    93   91